# Excercise 4.6

# Shaquille Obomeghie

### Content List 
1. Import Libraries 
2. Import Files
3. Combining Data

### 1. Import Libraries

In [2]:
# Import libraries 
import pandas as pd
import numpy as np
import os

###  2. Import Files

In [3]:
# Import .pkl file 
path = r'/Users/shaquillelee/Documents/Instacart Basket Analysis'

In [4]:
# Import .pkl file 'orders_products_combined'
orders_products_combined = pd.read_pickle(os.path.join(path, 'Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [5]:
# Import Product data 
product_data = pd.read_csv(os.path.join(path,'Data','Prepared Data', 'product_data_checked.csv'), index_col = 0)

In [6]:
orders_products_combined.head()

,order_id,user_identity_number,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,7.0,196,1,0,both
1,2539329,1,1,2,8,7.0,14084,2,0,both
2,2539329,1,1,2,8,7.0,12427,3,0,both
3,2539329,1,1,2,8,7.0,26088,4,0,both
4,2539329,1,1,2,8,7.0,26405,5,0,both

In [7]:
orders_products_combined = orders_products_combined.drop(columns='_merge')

In [8]:
# Checking the dimesion of the database to check consistency 
orders_products_combined.shape

(32434489, 9)

In [9]:
product_data.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [10]:
# Checking the dimension of the product data 
product_data.shape

(49693, 5)

# 3. Combining Data

 The appropriate method of combining the data would be to use the merge data for various reasons but one important reason is the difference in the sixe of columns and rows of both dataframes

In [11]:
# Merging the order_product 
ords_probs_merged = orders_products_combined.merge(product_data, on = 'product_id', indicator = True, how = 'outer')

In [12]:
# Checking the output od the merge
ords_probs_merged.head()

,order_id,user_identity_number,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,3139998.0,138.0,28.0,6.0,11.0,3.0,1,5.0,0.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,both
1,1977647.0,138.0,30.0,6.0,17.0,20.0,1,1.0,1.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,both
2,389851.0,709.0,2.0,0.0,21.0,6.0,1,20.0,0.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,both
3,652770.0,764.0,1.0,3.0,13.0,7.0,1,10.0,0.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,both
4,1813452.0,764.0,3.0,4.0,17.0,9.0,1,11.0,1.0,Chocolate Sandwich Cookies,61.0,19.0,5.8,both

In [13]:
# Checking the merger dimension 
ords_probs_merged.shape

(32436252, 14)

In [14]:
# There is 3,243,212 data that is consistent from both database but there is 2029 and 11 data there exist in either databases
ords_probs_merged['_merge'].value_counts()

_merge
both          32434212
left_only         2029
right_only          11
Name: count, dtype: int64

In [ ]:
# Export Data as pkl
ords_probs_merged.to_pickle(os.path.join(path, 'Data', 'Prepared Data', 'ords_probs_merge.pkl'))

In [ ]:
# Export Data as Csv
ords_probs_merged.to_csv(os.path.join(path, 'Data', 'Prepared Data', 'ords_probs_merge.csv'))